<!DOCTYPE html>
<html>
    <head>
        <link rel="stylesheet" href="estilos.css">
    </head>
    <body>
        <div class="contenido" id="texto">
            <div>
                <img class="foto" src="resources/yo.jpg">
                <div class="contenido">
                    <img src="resources/movil.png" class="contacto">
                    <p>644 966 016</p>
                </div>
                <div class="contenido">
                    <img src="resources/correo.png" class="contacto">
                    <p>jfrancod01@gmail.com</p>
                </div>
                <div class="contenido">
                    <img src="resources/linkedin.png" class="contacto">
                    <a href="https://www.linkedin.com/in/juan-n%C3%A9stor-franco-bab376386?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base_contact_details%3Bb%2BAVj5%2FxTF2Orsk8PnN2gw%3D%3D" target="_blank">Linkedin</a>
                    
                </div>
            </div>
            <div class="escrito">
                <h2>Sobre m&iacute;</h2>
                <p>
                    Recien graduado de DAM (Desarrollo de Aplicaciones Multiplataforma), teniendo tambien el t&iacute;tulo de ASIR(Administraci&oacute;n de Sistemas Inform&aacute;ticos en Red), Y hacinedo actualmente la especializaci&oacute;n en IA y Big Data.
                    Soy un entusiasta de la inform&aacute;tica y la programaci&oacute;n, que a&uacute;n faltandome experiencia, no me faltan las ganas de trabajar.
                </p>
                <h2>Proyectos</h2>
                
                <h3>Portal 64</h3>
                <div class="contenido">
                    <img src="resources/portal.png" class="ejemplos">
                    <p>
                        Este proyecto es m&aacute;s cercano a un proyecto de Sistemas que a uno de programador ya que yo no lo he desarrollado. 
                        Se basa en crear un cartucho funcional de portal64, que a su vez funione en hardware original (Nintendo 64).<br/>
                        Digo que es un trabajo m&aacute;s de sistemas, porque este juego no lo he programado yo, sino que a trav&eacute;s
                        del uso de distintas herramientas se ha realizado todo.
                        Se extraj&oacute; el juego del github original del creador del proyecto <a href="https://github.com/mwpenny/portal64-still-alive/tree/original?tab=readme-ov-file" target="_blank">[LINK Github]</a>, que se compil&oacute; y se cambio de uf2 a z64 para subida al cartucho.<br/>
                        Posteriormente a trav&eacute;s de esta otra herramienta que permite pushear
                        el z64 al cartucho se sube el juego a el Rasberry Pi que hace la funci&oacute;n de cartucho del juego.
                        Se envuelve todo en los elementos habituales de un cartucho de sus caracteristicas: pegatinas, cajas personalizadas, carcasa de cartucho de nintendo 64, etc. 
                    </p>
                </div>
                <h3>Pompa</h3>
                <div class="contenido">
                    <img src="resources/pompa1.png" class="ejemplos">
                    <div>
                        <p>
                            Pompa es un juego simple en 3D desarrollado en Unity, y programado en C#, donde la idea es mover el plano para hacer que una pelota llegue a la meta, as&iacute; como jugar&iacute;as con el tapon de un pompero.
                        </p><br/>
                        <img src="resources/pompa2.png" class="ejemplos dos">
                    </div>
                </div>
                <h3>OneShot Survivor</h3>
                <div class="contenido">
                    <img src="resources/survivor1.png" class="ejemplos">
                    <div>
                        <p>
                            Juego 2D desarrollado en Unity, cuyo objetivo es sobrevivir cuanto m&aacute;s tiempo se pueda antes de que uno de los enemigos te alcance. Con 3 mapas y un selector de dificultad. Toda la parte visual corre a cuenta de Assets de la store de Unity.
                        </p><br/>
                        <img src="resources/survivor2.png" class="ejemplos dos">
                    </div>
                </div>
                <h3>Proxy Trampa</h3>
                <div class="contenido">
                    <img src="resources/asir1.png" class="ejemplos">
                    <div>
                        <p>
                            El que fue mi proyecto de final de grado para ASIR. Se basa en un servidor proxy an&oacute;nimo, montado con Squid, que se conectar&iacute;a por ti a las p&aacute;ginas web. Pero este guardaba todo el tr&aacute;fico en base de datos, 
                            para luego mostrar mediante gr&aacute;ficas en una p&aacute;gina web mediante el uso de php y la librer&iacute;a de jgraphs, para que estaban realmente usando los usuarios el proxy.    
                        </p><br/>
                        <img src="resources/asir2.png">
                    </div>
                </div>
                <h3>D&D Api Java</h3>
                <div class="contenido">
                    <img src="resources/api1.png" class="ejemplos">
                    <p>
                        Trabajo simple que mediante el uso de una API publicada en internet con la informaci&oacute;n del manual de Dungeons and Dragons, esta aplicaci&oacute;n desarrollada en java te permite saber toda la informaci&oacute;n necesaria relevante a cada clase, 
                        para facilitar la informaci&oacute;n en todo momento para crear una ficha de personaje.
                    </p>
                </div>
                <h3>App Cines 7 Infantes</h3>
                <div class="contenido">
                    <img src="resources/7infantes.png" class="ejemplos">
                    <p>
                        Aplicaci&oacute;n de m&oacute;vil desarrollada en android studio, y usando como lenguaje java. Est&aacute; aplicaci&oacute;n estar&iacute;a enfocada en los socios de los cines 7 Infantes, para que estos puedan acceder desde el movil a la 
                        cartelera actual as&iacute; como poder ver precios actuales y posibles descuentos o los puntos que llevan acumulados como socios del cine.
                    </p>
                    <img src="resources/7infantes2.png" class="ejemplos">
                </div>
            </div>
        </div>    
    </body>
</html>
